In [1]:
import pandas as pd
from matplotlib import pyplot as plt
import numpy as np

%matplotlib inline

In [2]:
lst = [[35, 'Portugal', 94], [33, 'Argentina', 93], [30 , 'Brazil', 92]]
cols = ["Age","Nationality","Overall"]

df = pd.DataFrame(data=lst, columns=cols, index=[i for i in range(1,4)])
df

   Age Nationality  Overall
1   35    Portugal       94
2   33   Argentina       93
3   30      Brazil       92

In [3]:
df2 = pd.DataFrame(data=lst, columns=cols, index=[1,2,3])
df2

   Age Nationality  Overall
1   35    Portugal       94
2   33   Argentina       93
3   30      Brazil       92

In [4]:
arr = np.array([[94, 89, 63], 
                [93, 92, 48],
                [92, 94, 56]]
              )

arr[:2, 1:]

array([[89, 63],
       [92, 48]])

In [5]:
food = pd.read_csv("food.csv", encoding="latin-1")

In [65]:
food.head(5)

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
0,4,Algeria,2501,Population,511,Total Population - Both sexes,1000 persons,38924.00,39728.00,40551.00,41389.00,42228.00
1,4,Algeria,2501,Population,5301,Domestic supply quantity,1000 tonnes,0.00,0.00,0.00,0.00,0.00
2,4,Algeria,2901,Grand Total,664,Food supply (kcal/capita/day),kcal/capita/day,3377.00,3379.00,3372.00,3341.00,3322.00
3,4,Algeria,2901,Grand Total,674,Protein supply quantity (g/capita/day),g/capita/day,94.90,94.35,94.72,92.82,91.83
4,4,Algeria,2901,Grand Total,684,Fat supply quantity (g/capita/day),g/capita/day,80.06,79.36,77.40,80.19,77.28

In [73]:
food["Y2017"].agg([np.mean, np.std]).round(2)

mean     140.92
std     1671.86
Name: Y2017, dtype: float64

In [83]:
area_2017_sum = food[["Area", "Y2017"]].groupby("Area").sum().sort_values("Y2017", ascending=False)
area_2017_sum.iloc[[0]]

              Y2017
Area
Nigeria  1483268.23

In [81]:
item_groupby = food.groupby("Item")[["Y2015", "Y2018"]].sum()
wine_2015_2018 = item_groupby.loc[["Wine"]]
wine_2015_2018

        Y2015    Y2018
Item
Wine  4251.81  4039.32

In [82]:
element_groupby = food.groupby("Element")[["Y2017"]].sum()
processing_2017 = element_groupby.loc[["Processing"]]
processing_2017

               Y2017
Element
Processing  292836.0

In [58]:
production = item_groupby.loc["Production", ["Y2014"]]
production

Y2014    1931287.75
Name: Production, dtype: float64

In [84]:
area_2017_sum.iloc[[-7]]

                  Y2017
Area
Guinea-Bissau  19102.77

In [86]:
madagascar = food[food["Area"] == "Madagascar"]
elements_groupby_2015 = madagascar.groupby("Element")[["Y2015"]].sum()
madagascar_psq_2015 = elements_groupby_2015.loc[["Protein supply quantity (g/capita/day)"]]
madagascar_psq_2015

                                         Y2015
Element
Protein supply quantity (g/capita/day)  173.05

In [90]:
corr = food[["Element Code", "Y2014", "Y2015", "Y2016"	, "Y2017", "Y2018"]].corr()
corr.style.background_gradient()

In [94]:
food_2014 = food[["Y2014"]]
missing_total = food_2014.isna().sum()
percent_missing = (missing_total / food_2014.shape[0]) * 100
print("Total rows with missing numbers in 2014", missing_total.values)
print("Percent of the rows with missing numbers in 2014", percent_missing.values.round(3))

Total rows with missing numbers in 2014 [1589]
Percent of the rows with missing numbers in 2014 [2.607]

In [98]:
stock_variation = food.groupby("Element")[["Y2014", "Y2015", "Y2016"	, "Y2017", "Y2018"]].sum().loc[["Stock Variation"]]
stock_variation

                    Y2014     Y2015     Y2016     Y2017     Y2018
Element
Stock Variation  58749.83  34910.99  33140.12  54316.91  20577.91

In [99]:
countries = food.Area.nunique()
txt = "There are {} countries in the dataset."
print(txt.format(countries))

There are 49 countries in the dataset.